ZigEmbeddedGroup/texasinstruments-data/targetdb/Modules/HSM/f29h85x_hsm_ecc_aggr_regs.xml
<module id="HSM_ECC_AGGR" HW_revision="" description="HSM ECC AGGR Registers">
	<register id="AGGR_REVISION" width="32" page="0" offset="0" internal="0" description="Aggregator Revision Register">
		<bitfield id="SCHEME" description="" begin="31" end="30" width="2" rwaccess="R"/>
		<bitfield id="BU" description="" begin="29" end="28" width="2" rwaccess="R"/>
		<bitfield id="MODULE_ID" description="" begin="27" end="16" width="12" rwaccess="R"/>
		<bitfield id="REVRTL" description="" begin="15" end="11" width="5" rwaccess="R"/>
		<bitfield id="REVMAJ" description="" begin="10" end="8" width="3" rwaccess="R"/>
		<bitfield id="CUSTOM" description="" begin="7" end="6" width="2" rwaccess="R"/>
		<bitfield id="REVMIN" description="" begin="5" end="0" width="6" rwaccess="R"/>
	</register>
	<register id="ECC_VECTOR" width="32" page="0" offset="8" internal="0" description="ECC Vector Register">
		<bitfield id="ECC_VECTOR" description="" begin="10" end="0" width="11" rwaccess="RW"/>
		<bitfield id="RD_SVBUS" description="" begin="15" end="15" width="1" rwaccess="RW"/>
		<bitfield id="RD_SVBUS_ADDRESS" description="" begin="23" end="16" width="8" rwaccess="RW"/>
		<bitfield id="RD_SVBUS_DONE" description="" begin="24" end="24" width="1" rwaccess="RW"/>
	</register>
	<register id="MISC_STATUS" width="32" page="0" offset="12" internal="0" description="Misc Status">
		<bitfield id="NUM_RAMS" description="" begin="10" end="0" width="11" rwaccess="R"/>
	</register>
	<register id="ECC_CTRL" width="32" page="0" offset="0x14" internal="0" description="ECC Control Register">
		<bitfield id="ECC_ENABLE" description="" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="ECC_CHECK" description="" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="ENABLE_RMW" description="" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="FORCE_SEC" description="" begin="3" end="3" width="1" rwaccess="RW"/>
		<bitfield id="FORCE_DED" description="" begin="4" end="4" width="1" rwaccess="RW"/>
		<bitfield id="FORCE_N_ROW" description="" begin="5" end="5" width="1" rwaccess="RW"/>
		<bitfield id="ERROR_ONCE" description="" begin="6" end="6" width="1" rwaccess="RW"/>
		<bitfield id="CHECK_PARITY" description="" begin="7" end="7" width="1" rwaccess="RW"/>
		<bitfield id="CHECK_SVBUS_TIMEOUT" description="" begin="8" end="8" width="1" rwaccess="RW"/>
	</register>
	<register id="ECC_ERR_CTRL1" width="32" page="0" offset="0x18" internal="0" description="ECC Error Control1 Register">
		<bitfield id="ECC_ROW" description="" begin="31" end="0" width="32" rwaccess="RW"/>
	</register>
	<register id="ECC_ERR_CTRL2" width="32" page="0" offset="0x20" internal="0" description="ECC Error Control2 Register">
		<bitfield id="ECC_BIT1" description="" begin="15" end="0" width="16" rwaccess="RW"/>
		<bitfield id="ECC_BIT2" description="" begin="31" end="16" width="16" rwaccess="RW"/>
	</register>
	<register id="ECC_ERR_STAT1" width="32" page="0" offset="0x1C" internal="0" description="ECC Error Status1 Register">
		<bitfield id="ECC_SEC" description="" begin="1" end="0" width="2" rwaccess="RW"/>
		<bitfield id="ECC_DED" description="" begin="3" end="2" width="2" rwaccess="RW"/>
		<bitfield id="ECC_OTHER" description="" begin="4" end="4" width="1" rwaccess="RW"/>
		<bitfield id="PARITY_ERROR" description="" begin="6" end="5" width="2" rwaccess="RW"/>
		<bitfield id="CTRL_REG_ERROR" description="" begin="7" end="7" width="1" rwaccess="RW"/>
		<bitfield id="CLR_ECC_SEC" description="" begin="9" end="8" width="2" rwaccess="RW"/>
		<bitfield id="CLR_ECC_DED" description="" begin="11" end="10" width="2" rwaccess="RW"/>
		<bitfield id="CLR_ECC_OTHER" description="" begin="12" end="12" width="1" rwaccess="RW"/>
		<bitfield id="CLR_PARITY_ERROR" description="" begin="14" end="13" width="2" rwaccess="RW"/>
		<bitfield id="CLR_CTRL_REG_ERROR" description="" begin="15" end="15" width="1" rwaccess="RW"/>
		<bitfield id="ECC_BIT1" description="" begin="31" end="16" width="16" rwaccess="R"/>
	</register>
	<register id="ECC_ERR_STAT2" width="32" page="0" offset="0x24" internal="0" description="ECC Error Status2 Register">
		<bitfield id="ECC_ROW" description="" begin="31" end="0" width="32" rwaccess="R"/>
	</register>
	<register id="ECC_ERR_STAT3" width="32" page="0" offset="0x28" internal="0" description="ECC Error Status3 Register">
		<bitfield id="WB_PEND" description="" begin="0" end="0" width="1" rwaccess="R"/>
		<bitfield id="SVBUS_TIMEOUT" description="" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="CLR_SVBUS_TIMEOUT" description="" begin="9" end="9" width="1" rwaccess="RW"/>
	</register>
	<register id="SEC_EOI_REG" width="32" page="0" offset="60" internal="0" description="EOI Register">
		<bitfield id="EOI_WR" description="" begin="0" end="0" width="1" rwaccess="RW"/>
	</register>
	<register id="SEC_STATUS_REG0" width="32" page="0" offset="64" internal="0" description="Interrupt Status Register 0">
		<bitfield id="BOOTROM_RAMECC_PEND" description="" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="STASHROM_RAMECC_PEND" description="" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="RAM0_RAMECC_PEND" description="" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="RAM1_RAMECC_PEND" description="" begin="3" end="3" width="1" rwaccess="RW"/>
		<bitfield id="SECRAM_RAMECC_PEND" description="" begin="4" end="4" width="1" rwaccess="RW"/>
		<bitfield id="MBOXRAM_L2K_RAMECC_PEND" description="" begin="5" end="5" width="1" rwaccess="RW"/>
		<bitfield id="MBOXRAM_H2K_RAMECC_PEND" description="" begin="6" end="6" width="1" rwaccess="RW"/>
	</register>
	<register id="SEC_ENABLE_SET_REG0" width="32" page="0" offset="128" internal="0" description="Interrupt Enable Set Register 0">
		<bitfield id="BOOTROM_RAMECC_ENABLE_SET" description="" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="STASHROM_RAMECC_ENABLE_SET" description="" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="RAM0_RAMECC_ENABLE_SET" description="" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="RAM1_RAMECC_ENABLE_SET" description="" begin="3" end="3" width="1" rwaccess="RW"/>
		<bitfield id="SECRAM_RAMECC_ENABLE_SET" description="" begin="4" end="4" width="1" rwaccess="RW"/>
		<bitfield id="MBOXRAM_L2K_RAMECC_ENABLE_SET" description="" begin="5" end="5" width="1" rwaccess="RW"/>
		<bitfield id="MBOXRAM_H2K_RAMECC_ENABLE_SET" description="" begin="6" end="6" width="1" rwaccess="RW"/>
	</register>
	<register id="SEC_ENABLE_CLR_REG0" width="32" page="0" offset="192" internal="0" description="Interrupt Enable Clear Register 0">
		<bitfield id="BOOTROM_RAMECC_ENABLE_CLR" description="" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="STASHROM_RAMECC_ENABLE_CLR" description="" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="RAM0_RAMECC_ENABLE_CLR" description="" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="RAM1_RAMECC_ENABLE_CLR" description="" begin="3" end="3" width="1" rwaccess="RW"/>
		<bitfield id="SECRAM_RAMECC_ENABLE_CLR" description="" begin="4" end="4" width="1" rwaccess="RW"/>
		<bitfield id="MBOXRAM_L2K_RAMECC_ENABLE_CLR" description="" begin="5" end="5" width="1" rwaccess="RW"/>
		<bitfield id="MBOXRAM_H2K_RAMECC_ENABLE_CLR" description="" begin="6" end="6" width="1" rwaccess="RW"/>
	</register>
	<register id="DED_EOI_REG" width="32" page="0" offset="316" internal="0" description="EOI Register">
		<bitfield id="EOI_WR" description="" begin="0" end="0" width="1" rwaccess="RW"/>
	</register>
	<register id="DED_STATUS_REG0" width="32" page="0" offset="320" internal="0" description="Interrupt Status Register 0">
		<bitfield id="BOOTROM_RAMECC_PEND" description="" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="STASHROM_RAMECC_PEND" description="" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="RAM0_RAMECC_PEND" description="" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="RAM1_RAMECC_PEND" description="" begin="3" end="3" width="1" rwaccess="RW"/>
		<bitfield id="SECRAM_RAMECC_PEND" description="" begin="4" end="4" width="1" rwaccess="RW"/>
		<bitfield id="MBOXRAM_L2K_RAMECC_PEND" description="" begin="5" end="5" width="1" rwaccess="RW"/>
		<bitfield id="MBOXRAM_H2K_RAMECC_PEND" description="" begin="6" end="6" width="1" rwaccess="RW"/>
	</register>
	<register id="DED_ENABLE_SET_REG0" width="32" page="0" offset="384" internal="0" description="Interrupt Enable Set Register 0">
		<bitfield id="BOOTROM_RAMECC_ENABLE_SET" description="" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="STASHROM_RAMECC_ENABLE_SET" description="" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="RAM0_RAMECC_ENABLE_SET" description="" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="RAM1_RAMECC_ENABLE_SET" description="" begin="3" end="3" width="1" rwaccess="RW"/>
		<bitfield id="SECRAM_RAMECC_ENABLE_SET" description="" begin="4" end="4" width="1" rwaccess="RW"/>
		<bitfield id="MBOXRAM_L2K_RAMECC_ENABLE_SET" description="" begin="5" end="5" width="1" rwaccess="RW"/>
		<bitfield id="MBOXRAM_H2K_RAMECC_ENABLE_SET" description="" begin="6" end="6" width="1" rwaccess="RW"/>
	</register>
	<register id="DED_ENABLE_CLR_REG0" width="32" page="0" offset="448" internal="0" description="Interrupt Enable Clear Register 0">
		<bitfield id="BOOTROM_RAMECC_ENABLE_CLR" description="" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="STASHROM_RAMECC_ENABLE_CLR" description="" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="RAM0_RAMECC_ENABLE_CLR" description="" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="RAM1_RAMECC_ENABLE_CLR" description="" begin="3" end="3" width="1" rwaccess="RW"/>
		<bitfield id="SECRAM_RAMECC_ENABLE_CLR" description="" begin="4" end="4" width="1" rwaccess="RW"/>
		<bitfield id="MBOXRAM_L2K_RAMECC_ENABLE_CLR" description="" begin="5" end="5" width="1" rwaccess="RW"/>
		<bitfield id="MBOXRAM_H2K_RAMECC_ENABLE_CLR" description="" begin="6" end="6" width="1" rwaccess="RW"/>
	</register>
	<register id="AGGR_ENABLE_SET" width="32" page="0" offset="512" internal="0" description="AGGR interrupt enable set Register">
		<bitfield id="PARITY" description="" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="TIMEOUT" description="" begin="1" end="1" width="1" rwaccess="RW"/>
	</register>
	<register id="AGGR_ENABLE_CLR" width="32" page="0" offset="516" internal="0" description="AGGR interrupt enable clear Register">
		<bitfield id="PARITY" description="" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="TIMEOUT" description="" begin="1" end="1" width="1" rwaccess="RW"/>
	</register>
	<register id="AGGR_STATUS_SET" width="32" page="0" offset="520" internal="0" description="AGGR interrupt status set Register">
	</register>
	<register id="AGGR_STATUS_CLR" width="32" page="0" offset="524" internal="0" description="AGGR interrupt status clear Register">
	</register>
</module>
